trade_exp/src/Documents/ТелефонныйЗвонок/ТелефонныйЗвонок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТелефонныйЗвонок</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="86df8648-e195-4661-99ee-6052788eb276">
    <name>Входящий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7fc37008-c378-4a70-a9a9-07543c7248a6">
    <name>Тема</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0dfbe7a9-9c2e-4cbd-ac53-3b547fd73e91">
    <name>АбонентПредставление</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a22cf6e9-1157-4be5-8d30-aa9bbf2b5e6e">
    <name>Описание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="67ef6671-f537-46bf-88e6-f5bcf34a17a4">
    <name>АбонентКакСвязаться</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="de778ca7-feaf-4531-80ae-11a534c56928">
    <name>АбонентКонтакт</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6410853e-a17e-44db-b8cc-bfefd7c4d239">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="35133725-9647-42dc-a76a-2e62b2918ac4">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2b6c4184-6d7d-48e5-bd4e-ad31e63398d6">
    <name>Важность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0a76a84d-e883-477e-8b87-7bf984cdc1cf">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c7b883dc-6c26-4eb5-bc19-7919ad57da27">
    <name>ВзаимодействиеОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="12055ab8-aa14-44ba-a952-006febab54b8">
    <name>ТипОбращения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="470f2f3d-68f1-43aa-b017-17ec1b19cb78">
    <name>НачалоСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="55d708be-f064-4170-b8fd-d27aa4db0369">
    <name>ОкончаниеСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="425631ea-c386-43ef-91c7-6e111ae572ff">
    <name>ТипСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="851e22e5-891f-498d-89f6-d471f241ab76">
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d207962d-87fa-4f4c-a30b-62dcde13017f">
    <name>ВходящееИсходящееСобытие</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Document>

trade_exp/src/Enums/ТипыОбращенийВCallЦентр/ТипыОбращенийВCallЦентр.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="7423d922-aaf3-48b8-bdf0-984bdef69da8">
  <name>ТипыОбращенийВCallЦентр</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="0e9563d1-70fb-4d7c-bf42-d8073c251abd">
    <name>Консультация</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="58e0de71-632f-4ee5-b3bc-14c289f438cd">
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="254643be-1140-4949-9402-608c96162bf8">
    <name>Жалоба</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="93a81b8b-486b-46d0-bc11-92b3f57dcef2">
    <name>Перевод</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b8d0dcd9-aa24-49c4-875c-875b14f75c6a">
    <name>Прочее</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/ТелефонныйЗвонок/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&После("ОбработкаПроверкиЗаполнения")
Процедура Док_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	МассивНепроверяемыхРеквизитов = Новый Массив;
	МассивНепроверяемыхРеквизитов.Добавить("Описание");
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
КонецПроцедуры

&После ("ПриЗаписи")
Процедура Док_ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не значениезаполнено(ТипОбращения) Тогда
		ТипОбращения=Перечисления.ТипыОбращенийВCallЦентр.Консультация;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
